Repository: BDSU/limesurvey-oauth2
Catalog: locale/*-informal/*-informal.po
Languages: de

source: Comma-separated list of scopes to use for authorization.
de: Kommagetrennte Liste der Scopes für die Authorisierung.

source: User Details URL
de: Benutzerdetails URL

source: URL to load the user details from using the retrieved access token.
de: URL, von der die Benutzerdetails mit dem erhaltenen "Access Token" geladen werden.

source: Identifier Attribute
de: Identifikationsattribut

source: Attribute of the LimeSurvey user to match against.
de: Attribut anhand dessen der LimeSurvey-Benutzer zugeordnet wird.

source: Username
de: Benutzername

source: Key for username in user details
de: Feld für Benutzername in den Benutzerdetail-Daten

source: Key for the username in the user details data. Only required if used as "Identifier Attibute" or if "Create new users" is enabled.
de: Feldname für den Benutzername in den Benutzerdetail-Daten. Nur benötigt, wenn als "Identifikationsattribut" verwendet oder wenn "Neue Benutzer anlegen" aktiviert ist

source: Key for e-mail in user details
de: Feld für E-Mail in den Benutzerdetail-Daten

source: Key for the e-mail in the user details data. Only required if used as "Identifier Attibute" or if "Create new users" is enabled.
de: Feldname für die E-Mail in den Benutzerdetail-Daten. Nur benötigt, wenn als "Identifikationsattribut" verwendet oder wenn "Neue Benutzer anlegen" aktiviert ist

source: Key for display name in user details
de: Feld für Anzeigenamen in den Benutzerdetail-Daten

source: Key for the full name in the user details data. Only required if "Create new users" is enabled.
de: Feldname für den vollen Namen in den Benutzerdetail-Daten. Nur benötigt, wenn "Neue Benutzer anlegen" aktiviert ist

source: Use as default login
de: Als Standard-Login verwenden

source: If enabled instead of showing the LimeSurvey login the user is redirected directly to the OAuth2 login. The default login form can always be accessed via:
de: Wenn aktiviert, werden Benutzer direkt zum OAuth2-Login weitergeleitet, anstatt das Login-Formular von LimeSurvey anzuzeigen. Das normale Login-Formular ist dabei jederzeit noch erreichbar unter:

source: Create new users
de: Neue Benutzer anlegen

source: If enabled users that do not exist yet will be created in LimeSurvey after successfull login.
de: Wenn aktiviert, werden Benutzer nach erfolgreichem Login in LimeSurvey erstellt, wenn sie noch nicht existieren.

source: Global roles for new users
de: Benutzerrollen für neue Benutzer

source: Global user roles to be assigned to users that are automatically created.
de: Globale Benutzerrollen, die allen automatisch erstellten Benutzern zugewiesen werden.

source: Global permissions for new users
de: Globale Berechtigungen für neue Benutzer

source: A JSON object describing the default permissions to be assigned to users that are automatically created. The JSON object has the follwing form: %s
de: Ein JSON-Objekt mit den globale Berechtigungen, die allen automatisch erstellten Benutzern zugewiesen werden. Das JSON-Objekt hat hierfür die folgende Form: %s

source: Invalid state in OAuth response
de: Ungültiger Status in OAuth-Antwort

source: Failed to retrieve access token
de: Konnte "Access Token" nicht abrufen

source: Failed to retrieve user details
de: Benutzerdetails konnten nicht abgerufen werden

source: User identifier not found or empty
de: Benutzerkennung nicht gefunden oder leer

source: User not found in LimeSurvey
de: Benutzer konnte in LimeSurvey nicht gefunden werden

source: User data is missing required attributes to create new user
de: Benötigte Attribute in Benutzerdetails fehlen

source: Failed to create new user
de: Benutzer konnte nicht erstellt werden
